/*********************************Copyright (c)*********************************                                      
                                           
******************************************************************************
  * 文件名称：main.C
  * 描    述：完成2个雷达数据接收与整合及2个陀螺仪姿态解算并发送到线树测距上位机
  * 创 建 者: r00kies
  * 创建日期: 2017-11-25
  * 修 改 者:             
  * 修改日期: 
  * 版    本: 
  ******************************************************************************
  * attention
  *
  ******************************************************************************
  */
/*Includes --------------------------------------------------------------------*/
  #include "includes.h"
//////////////////////////////////////////////////////////////////////////////////////////
	unsigned short int systick_num=0x00; //systick计数器变量
  uint8_t dataToComputer[10] = {'!',0xFF, 0xFF, 0xFF, 0xFF,0,0,0,0,'$'};
	extern Mpu_data mpu_series1,mpu_series2;
	uint8_t system_state=0;//系统初始化完成标志 开始发送数据
/********************************************************************************
函数名称: main()
功    能: 主函数入口
参    数: 无
返 回 值: 无	  
*********************************************************************************/
int main(void)
{ 
	SystemInit();    //系统时钟配置 
	Systick_Init();  //打开systick定时器,1ms
  Uart_Init();     //串口1/115200//上位机通讯
	Uart2_Init();    //串口2/115200//雷达1数据透传接收
  Uart3_Init();    //串口3/115200//雷达2数据透传接收
	Uart4_Init();    //串口4/115200//串口调试
	delay_ms(10000);  //延时1s/等待mpu6050上电稳定
	/////////////////////////////////////////////////////////
	//初始化陀螺仪1/（四元数法解算）
  while(MPU6050_Initialization() == 0xff) 
	{   
		printf("mpu60501 not connect!\r\n");
	}
	///////////////////////////////////////////////////////////
	//初始化陀螺仪2/（DMP解算）
	IIC_Init();
  while(!MPU6050_testConnection())
	{
		printf("mpu60502 not connect!\r\n");
	}
	MPU6050_initialize();
	delay_ms(1000);
	DMP_Init();
	EXTI2_3_Config();
	////////////////////////////////////////////////////////////
	system_state=1;//系统初始化完成开始传送数据
		
	//IWDG_Init();
  while(1)
	{  
	  //ANO_DT_Send_Status( mpu_series1.roll,  mpu_series2.roll, 0, 0, 0, 0);//上位机实时显示陀螺仪姿态
		//IWDG_ReloadCounter();
		//delay_ms(100);
  }  
}

/**
  * @}
  */ 
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
